{"sourceName": "Pawan Nahar", "pubdate": "2019-10-07", "text": "After two long lethargic years, the domestic primary market is keenly awaiting some renowned firms to get listed.These companies have the who's who of India Inc and Dalal Street associated with them: from India's top industrialist Mukesh Ambani to Big Bull Rakesh Jhunjhunwala and cricketing biggie MS Dhoni Market watchers say a frenzy is already building up in anticipation of an imminent listing of these stocks. Investors are rushing in to the unlisted market to buy these stocks before value unlocking begins.Some of these firms have strong balance sheets and credible financials to support this frenzy.ETMarkets.com collated a list of the unlisted names that have been buzzing in the grey market in recent weeks amid talks that they may get listed over the next 18 months.With the strong parentage of HDFC group, HDB Financial Services is a leading NBFC stock buzzing in the grey market and seeing a lot of demand from investors. Incorporated in 2008, the NBFC caters to both retail and commercial clients. It has a well-established business of loans, fee-based products and BPO services with a strong capital base. It has been accredited with an 'AAA' rating for it long-term debt and bank facilities by CRISIL and Care Ratings. Its short-term debt and CPs are rated A1+, which makes it a reliable financial institution.Expert Take: Sagar Shah of Ascent Wealth Advisors believes it is a good NBFC bet. Despite expensive valuations, it is poised to grow with a clean and strong balance sheet.'People are buying this stock in the unlisted market at a premium. It is highly likely that the IPO will get robust over-subscription. Thus, there is this buoyancy,' he said.Mumbai-based Nazara Technologies is one of the leading mobile games companies operating in India, West Asia, Africa, Southeast Asia and Latin America. Its operations comprise subscription, freemium and Esports businesses.The company has independent subsidiaries, named Next Wave Multimedia and NODWIN GAMING.Big Bull Rakesh Jhunjhunwala is backing this venture, which is credited with some of the most popular games on Google play store, such as World Cricket Championship, Chhota Bheem Race and Motu Patlu Game.According to the company the drop in profit to Rs 1 crore for FY17-18 was due to one-time non-cash and exceptional expenditures including group share payments and employee stock options.Dinesh Gupta of Unlisted Zone says the company has lost some of its lustre lately. However, it has been aggressive in acquisition, having recently acquired a stake worth Rs 7.5 crore in India's leading quiz app Sports Unity.Formerly known as The Nadar Bank, this lender has over 500 branches and 12 regional offices across the nation. All the branches are computerised and interconnected. Hailing from Tamil Nadu, the bank has strong roots in south India.This stock has been getting mixed reaction from market experts. Sandip Ginodia of Abhishek Securities finds TMB a valuable bet. 'The stock is available at 1.25 times book value. A robust loan book is keeping the estimates highs,' he said.Gupta of UnlistedZone said developments in YES Bank and RBL Bank have led to a carnage of this stock in the unlisted market as there are better bets in the market.Reliance Retail, a part of Reliance group, is the largest retail company in India. The Mukesh Ambani-led venture operates Reliance Fresh, Reliance Smart and Reliance Market Stores, and has a turnover of Rs 1.3 lakh crore. It also operates all Reliance Digital, Mini Express Stores and Jio Stores.Alongside, it also runs Reliance Trends, Trends Women, Reliance Jewels, Reliance Footprints and fashion website Ajio.According to its annual report of FY19, the subsidiary of Reliance Industries had 10,415 stores in over 6,600 cities and towns of India, with total area over 22 million sq. ft. as of March 31, 2019.Shah of Ascent Wealth believes the stock valuation is very high compared with its peer Avenue Supermarts. Reliance Retail is operating at a massive scale, which maintains constant pressure on margins. 'The company has a very strong promoter. The retail story is set to prosper in India.'He and Ginodia gave this stock a thumbs-up from a long-term perspective.Studds is one of the largest two-wheeler helmet manufacturers in the world. It has a 25 per cent market share in India, boasting safety, comfort and style.Incorporated in 1983, the company has two manufacturing facilities spread over 6 acres in Faridabad, Haryana.The company has its presence in 39 countries and launched 36 new products in last three years in seven different sizes. The company also manufactures two-wheeler accessories such as jackets, gloves and glasses. The company has already filed DHRP with Sebi.Gupta said Studds would be the biggest beneficiary of the new Motor Vehicles Act. There is high demand for helmets in the market and the company has biggest market share. He pointed out that non-ISO-certified helmet manufacturers are soon going to be fined heavily.Unlisted shares of this IPL franchise have been drawing lot of attention amid rumours surrounding possible retirement of MS Dhoni. CSK has been the most successful franchise of the IPL, winning the title thrice. The unlisted scrip traded in the Rs 12-15 range in the last week of November, 2018, and then jumped to Rs 30-35 by mid-April 2019.Ginodia and Shah find the stock very attractive. Ginodia said the company's FY19 PAT was on the expected lines. Shah, however, suspects a dip in brand value after Dhoni retires. But, he too, finds the stock performance at par.", "title": "Market IPOs: Jhunjhunwala, Ambani, Dhoni & much of D-Street awaiting these big-bang IPOs", "URL": "https://economictimes.indiatimes.com/markets/stocks/news/jhunjhunwala-ambani-dhoni-much-of-d-street-awaiting-these-big-bang-ipos/articleshow/71473422.cms", "keywords": ["bank", "ambani", "ipos", "rs", "strong", "retail", "dstreet", "dhoni", "jhunjhunwala", "awaiting", "reliance", "india", "market", "bigbang", "company", "unlisted", "stock", "Jhunjhunwala", "rakesh jhunjhunwala", "Mukesh Ambani", "MSD", "Dhoni", "Studds", "Nazara", "Jhunjhunwala", "rakesh jhunjhunwala", "Mukesh Ambani", "MSD", "Dhoni", "Studds", "Nazara"], "industries": [], "uniqueID": "71473422"}