{"sourceName": "ETMarkets.com", "pubdate": "2019-10-07", "text": "NEW DELHI: Shares of YES Bank climbed over 9 per cent in Monday's trade after a report said that Microsoft is among three investors, which are in talks for a stake in YES Bank.The report emerged amid an ET report suggesting that global private equity players - TPG, The Carlyle Group and Farallon Capital - are seeking to buy large strategic stakes in YES Bank. Reuters report quoting Mint suggested that the bank is in talks with Microsoft and two other tech firms for a possible stake sale. The lender's scrip is under amid substantial exposure to ailing companies.The talks began three weeks ago and could see the bank selling as much as 15% through a fresh equity issue, Reuters quoted Mint citing two people aware of the discussions.The stake sale may fetch the lender Rs 2,000 crore, the paper said.Earlier, ET reported that private Equity funds TPG, The Carlyle Group and Farallon Capital are also looking to buy a stake in the company. The talks have advanced substantially in the past few days and they could result in one or more private equity firms taking a significant stake in the bank, providing the growth capital the lender needs to compete at the top-tier of Indian banking, ET reported.The bank's chief executive officer, Ravneet Gill, had said last week that the lender was in talks with private equity firms, strategic investors and family offices to raise additional capital.The shares of the lender closed 8.19 per cent higher at Rs 45.60 on BSE.", "title": "YES Bank in talks with Microsoft for stake sale; stock climbs 9%", "URL": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-in-talks-with-microsoft-for-stake-sale-stock-climbs-9/articleshow/71477242.cms", "keywords": ["stock", "private", "et", "stake", "bank", "climbs", "sale", "talks", "microsoft", "equity", "report", "lender", "yes", "firms", "Yes Bank Share Price", "Growth Capital", "Reuters", "Yes Bank", "Carlyle Hotel", "Microsoft", "Yes Bank Share Price", "Growth Capital", "Reuters", "Yes Bank", "Carlyle Hotel", "Microsoft"], "industries": [], "uniqueID": "71477242"}