{"sourceName": "ET CONTRIBUTORS", "pubdate": "2019-10-07", "text": "Lots of people attend training programmes on technical analysis , eager to learn new methods that can help them pick that magic stock, get into that big trend or exit near the top of a big move.They latch on to the method shown by the presenter, paying particular attention to the way the method is to be applied with an eye fixated all the time on the ultimate result - which is always profit.Yes, there is the stop loss to deal with the unfavourable outcome, and all of that is for others. 'Once I know this method,' they tell themselves, 'my trade will all reach their profit-making goals.'There is another class - the reader. In the earlier days, they used to read books, but now they read small, short writeups on the Net. Life has become faster after all, where is the time for reading a few-hundred-page book. I can get it all in a two-page writeup with two illustrations thrown in. And if I read about five such, hell, I am already well educated or indeed, well read!The problem with both the above sets - who are setting out to become traders, mind you - is that they are doing what is deemed 'necessary action' but without any understanding. The focus is on getting to the bottom line. This is so much like us, in real life, during some puja or undertaking some fast or attending a temple or church or mosque.We all go through the motions, because that is what we think is the deal. We all go through rituals of offering flowers or candles or chaddars and believe that we have done our bit. And if we don't do all these things, we feel guilty about it. We are even made to feel guilty about it by those around us, whether elder or younger.This is the classic case of ritualistic practice. Unless philosophy behind the rituals is known, this breeds superstition. Interpreters of Holy books will warn us of dire consequences in the here, as well as hereafter, if we don't 'DO' some things in some ways.Quite in the same way, traders also become superstitious. Some of them have ridiculous rituals that they believe is necessary for them to win. Some of them go to extreme lengths to avoid doing something in order not to lose. A typical translation of this in trading action is taking profits early or avoiding taking a loss.Understanding the method means understanding price action . How many people really spend time in a training programme, trying to understand basic price action? What is a trend? Why is there a congestion? Why should prices pull back? Why does a trendline work? What is the relevance of Fibonacci retracement and why does it work? Is there a reason the Bollinger should wax and wane and, if so, do I know it?Alas! I find too many of today's leaners of stock technicals more interested in the bottom line, or the last line, than concentrating on burnishing their basics. They all want to be PhDs without wanting to go through their school or college graduation. They think school learning with a casual look at a PhD book or its précis on the Net is sufficient to keep their education current.They feel they can discard much of the basics of price action analysis in favour of a few, explicable, computer-driven methods and expect to get great results. They will, from time to time. But long-term success? No chance.Price action lies at the root of all success in markets. Whether your approach is technical or fundamental, it does not matter any bit. If you do not invest your time in understanding market price behaviour, and continue to invest it every single day, the market will beat you every day, every year.Return to your basics at every chance you get and re-learn them many times over. Then, the chances that you will not get beaten by the market would increase exponentially.", "title": "Ridiculous rituals can’t help you win in market, but the basics can", "URL": "https://economictimes.indiatimes.com/markets/stocks/news/ridiculous-rituals-cant-help-you-win-in-market-but-the-basics-can/articleshow/71476793.cms", "keywords": ["read", "cant", "help", "feel", "method", "basics", "rituals", "action", "understanding", "market", "win", "price", "ridiculous", "line", "does", "investment tips", "investment basics", "technical analysis", "dalal street", "Price action", "Fibonacci retracement", "investment tips", "investment basics", "technical analysis", "dalal street", "Price action", "Fibonacci retracement"], "industries": [], "uniqueID": "71476793"}