{"sourceName": "Manish Anand And Amit Agnihotri", "pubdate": "2018-03-22", "text": "Manish Anand And Amit Agnihotri By  Express News Service  NEW DELHI: The Indian footprint of controversial data mining firm Cambridge Analytica (CA) that allegedly abused Facebook user data, on Thursday became political football as both the BJP and the Congress traded charges over who used it to influence elections in India.  Union Minister Ravi Shankar Prasad raised the pitch by pointing an accusing finger at the Congress while issuing a stern warning to Facebook CEO Mark Zuckerberg against using its data to profile Indians.  According to some reports, CA had offered its services to both parties before the 2014 general elections, but that fell through.  Categorically denying any link with the CA, Congress media department chairman Randeep Surjewala pointed out the shoe is on the other foot, as the CA website shows its services were used by BJP-JD(U) in Bihar polls in 2010.  Also, 'the firm's Indian partner Ovlene Business Intelligence (OBI) is being run by the son of a former Rajya Sabha MP of the JD (U),' referring to India head of OBI Amrish Tyagi, son of JD (U) leader KC Tyagi, whose 'services were used by Rajnath Singh in 2009', he added.  The BJP, he said, was trying to deflect public attention from the raging controversy over the deaths of 39 Indian hostages in Iraq and the massive publicity being received by party chief Rahul Gandhi's Karnataka campaign.  'The BJP is a factory of fake news and has produced one more fake product today,' he quipped.  Prasad, however, wondered whether the Opposition party had used the agency's playbook tricks to unleash divisive politics in Gujarat (during the Assembly elections) and now in Karnataka with the approaching state polls.  Dirty tricks department  Channel 4 sting operation catches Cambridge Analytica (CA) CEO Alexander Nix bragging that his company managed Donald Trump's digital campaign.  Says CA could send some girls to a rival candidate's house as honeytraps, claims girls from Ukraine are particularly effective in the role.  Trapping a rival candidate by offering a large amount of money, having the whole exchange recorded so it could be posted on the internet to show that the person is corrupt.  The key is to use fake identities to cover footprint in target countries, like setting up of fake academic projects.  Indian footprint  CA works through Ovleno Business Intelligence (OBI) owned by former JD(U) MP K C Tyagi's son Amrish.  Posing a set of seven questions, Prasad asked: 'Was data theft and manipulation ability the sole criteria for which CA was hired by Congress? How many times did Rahul Gandhi and CA's now sacked CEO Alexander Nix meet and what did they discuss? What is CA's role in Rahul Gandhi's social media presence? Can Congress deny CA's role in its campaign to divide the society for electoral gains first in Gujarat and now in Karnataka? Has the Congress taken any action after damning revelations were made public? How much stolen data from CA are in possession of the Congress? How much data of Indian users did the Congress hand over to CA?'  'I want to specifically warn the Congress that the nation will not tolerate any kind of data theft or manipulation. There have been more damning revelations about the role of CA, which has been found to be using illegal means of data manipulation to subvert democratic process in Kenya. We have all seen how Congress tried to divide the society in Gujarat just in order to win an election. We are seeing what they are doing in Karnataka. This is straight out of the Cambridge Analytica playbook,' he said.  The party's recently appointed chief of data analytics Praveen Chakravarty has also been accused of data theft in the past, he noted.  The minister also stated that the Central government is in touch with the Federal Trade Commission and Department of Justice in the US to assess the privacy violations of Indian users.", "title": "BJP, Congress spar over toxic data mining firm Cambridge Analytica's use to influence elections- The New Indian Express", "URL": "https://www.newindianexpress.com/nation/2018/mar/22/bjp-congress-spar-over-toxic-data-mining-firm-cambridge-analyticas-use-to-influence-elections-1790722.html", "keywords": ["facebook", " mark zuckerberg", " Ravi Shankar Prasad ", " KC Tyagi", " Amrish Tyagi", "  Cambridge Analytica", "facebook", " mark zuckerberg", " Ravi Shankar Prasad ", " KC Tyagi", " Amrish Tyagi", "  Cambridge Analytica"], "uniqueID": "1790722"}