{"sourceName": "ET Now", "pubdate": "2014-06-24", "text": "ET Now caught up with KV Kamath, Chairman, ICICI Bank, for his expectations from the Narendra Modi government as well as the Budget. Excerpts:If you look back to 10 years ago, the economy was getting into near double digit growth even with all the structural problems. Now you have a leader who has a known bias for fixing things and making sure that things work. It is the same set of structure, the same set of people who are driving this. You have the right leader who can drive the effort.The first sense comes from the market. It is the collective wisdom of the marketplace that there is action and we will move with speed. That improves the confidence level of industry. Now we need to see whether some of the ground conditions that are needed for people to get back to an investment mode are going to change. Today I read that with a large slate of reforms or projects which have been stuck are going to be addressed in the next few days. If that happens, you will see a sea change in the investment mindset, as it were.I think that between three and six months it could start happening. But we want incremental investment to happen. There is enough to harvest in the first six months in terms of stuck projects and so on.I do not want to call or second-guess what somebody is working on. But I think it will be a budget where you try to have fiscal discipline and whatever is needed to get that discipline. Now in what measure, in what combination, is for the government to call. I think one thing that people will look for in the budget is fiscal discipline and a way to getting the deficit under control, say, over a three-year period. If it is well-constructed and well-articulated, you will see the cheer going up.If you eliminate waste, you eliminate what is theft and eliminate what is not needed, the 4.1 is achievable.Regarding the monetary policy, we always say that let us see the constructive design of a fiscal deficit. We know what it is and where it will end. Once they see that construct as it were, for this year and, say, for two years on the line, then I should believe that they should have greater confidence to tinker with the rates, or inflation itself has to start dropping. We see several people have given several solutions starting with release food stocks, pushing the pedal on APMC reform, and so on. I am sure again this is something that the government will very quickly understand and take all the steps or some of the steps which would give policymakers confidence to get interest rates down. We should see it happen in this fiscal, in the next 12 months. I think it ought to start happening in the first six months.I have no call on this. Let us see what happens. Everything will depend on where the deficit number comes in and whether you are able to get the inflation rate moving down. If these turn out positive, rates could move fast.My long-term number does not have a single digit. It is two digits. So you can make a guess on it.I think it will happen during the term of this government.It will happen in the first term of this government. That is for sure. If they progress the way they mean to, I am reasonably sure that we will see two-digit rate in the first term of this government itself.", "title": "Confidence level of industry improving: KV Kamath, ICICI Bank", "URL": "https://economictimes.indiatimes.com/opinion/interviews/confidence-level-of-industry-improving-kv-kamath-icici-bank/articleshow/35945669.cms", "keywords": ["happen", "confidence", "term", "start", "level", "months", "icici", "say", "sure", "improving", "kv", "fiscal", "think", "rates", "needed", "industry", "bank", "kamath", "ICICI bank", "Inflation", "endorsements", "monetary policy", "stocks", "mean", "Misrepresentation", "Catch up effect", "Seasonal Adjustment", "Insurability", "settlement option", "Narendra Modi", "industry", "economy", "confidence", "expectations", "marketplace", "ICICI bank", "Inflation", "endorsements", "monetary policy", "stocks", "mean", "Misrepresentation", "Catch up effect", "Seasonal Adjustment", "Insurability"], "industries": [], "uniqueID": "35945669"}